app/controllers/calendar_controller.rb

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
---
  def index
    if params[:id]
      @group = Group.find(params[:id])