app/controllers/events_controller.rb

SELECT * FROM `events` WHERE (start_time>now() and group_id is NULL) ORDER BY start_time ASC
---
  def index
    @section = 'EVENTS'
    @events = Event.find(:all, :conditions=>'start_time>now() and group_id is NULL', :order=>'start_time ASC')