app/controllers/forum_topics_controller.rb

  def index
    @forum_topics = ForumTopic.find(:all, :conditions => ['group_id is NULL'])
---
SELECT * FROM `forum_topics` WHERE (group_id is NULL)