app/controllers/groups_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT `groups`.* FROM `groups` INNER JOIN `memberships` ON `groups`.id = `memberships`.group_id WHERE ((`memberships`.user_id = 1))
---
  def index
    sort = params[:sort_field]
    @sort_field = sort || 'created_at'
    @section = 'GROUPS'
    if params[:user_id]
      @user = User.find(params[:user_id])
      @group = @user.groups

SELECT `groups`.* FROM `groups` INNER JOIN `memberships` ON `groups`.id = `memberships`.group_id WHERE ((`memberships`.user_id = 1))
SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
SELECT * FROM `groups` WHERE (groups.name LIKE 'rails' AND id in (1,1,4)) LIMIT 0, 20
SELECT * FROM `wiki_pages` WHERE (wiki_pages.title LIKE 'rails' OR wiki_pages.content LIKE '%rails%' AND group_id in (1,1,4)) LIMIT 0, 20
SELECT * FROM `events` WHERE (events.name LIKE 'rails' AND group_id in (1,1,4)) LIMIT 0, 20
SELECT * FROM `forum_topics` WHERE (forum_topics.title LIKE 'rails' AND group_id in (1,1,4)) LIMIT 0, 20
---
  def search
    @params = params[:search]
    if logged_in?
      @user = current_user
      @groups_id = @user.groups
    else
      @groups_id = Group.find(:all)
    end
    @groups = Group.paginate :per_page => 20, :page => params[:page], :conditions => ['groups.name LIKE ? AND id in (?)',@params , @groups_id.collect{|x|x.id}]
    @events = Event.paginate :per_page => 20, :page => params[:page], :include => [ :group], :conditions => ['events.name LIKE ? AND group_id in (?)',@params , @groups_id.collect{|x|x.id}]
    @forums = ForumTopic.paginate :per_page => 20, :page => params[:page], :include => [ :group], :conditions => ['forum_topics.title LIKE ? AND  group_id in (?)',@params , @groups_id.collect{|x|x.id}]

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
SELECT * FROM `wiki_pages` WHERE (group_id in (1))
---
  def wiki_list
    @user = current_user
    @group = Group.find(params[:id])
    @wiki = WikiPage.find(:all, :conditions => ['group_id in (?)', @group.id])

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
SELECT * FROM `events` WHERE (`events`.group_id = 1) ORDER BY created_at DESC
---
  def events
    if params[:group_id] and !params[:type]
      @group = Group.find(params[:group_id])
    elsif   params[:event_id] and !params[:type]
      @event = Event.find(params[:event_id])

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
SELECT * FROM `forum_topics` WHERE (`forum_topics`.group_id = 1) ORDER BY created_at DESC
SELECT * FROM `forum_posts` WHERE (`forum_posts`.forum_topic_id = 9 AND (parent_id is null)) ORDER BY created_at DESC
UPDATE `forum_posts` SET `views` = 9, `updated_at` = '2010-05-24 06:13:11' WHERE `id` = 24
---
  def forums
    if !params[:forum_topic_id] and !params[:forum_post_id]
      @group = Group.find(params[:group_id])
    elsif params[:forum_topic_id] and !params[:forum_post_id]
      @forum_topic = ForumTopic.find(params[:forum_topic_id])
      @forum_posts = @forum_topic.forum_threads
      @group = Group.find(@forum_topic.group_id)
    else
      @forum_post = ForumPost.find(params[:forum_post_id])
      if @forum_post.parent_id != nil
        @forum_post = ForumPost.find(@forum_post.parent_id)
      end
      @forum_post.update_attributes(:views=>@forum_post.views+1)

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
SELECT * FROM `memberships` WHERE (approved =1 and group_id =1)
---
  def group_members
    @group = Group.find(params[:group_id])
    @members = Membership.find(:all, :conditions => ['approved =? and group_id =?', 1,@group.id ])

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
---
  def group_others
    @group = Group.find(params[:group_id])

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
SELECT * FROM `memberships` WHERE (approved =1 and group_id =1)
---
  def show
    @group = Group.find(params[:id])
    #self.id = @group
    @members = Membership.find(:all, :conditions => ['approved =? and group_id =?', 1,@group.id ])