app/controllers/sessions_controller.rb

  def create
    self.current_user = User.authenticate(params[:login], params[:password])
    if logged_in?
      expire_action :controller => :home, :action => :index
      flush_expired_sessions
      login_count = self.current_user.login_count
      login_count = login_count + 1
      self.current_user.update_attribute('login_count', login_count)
---
UPDATE `users` SET `updated_at` = '2010-05-20 05:33:16', `last_seen_at` = '2010-05-20 05:33:16' WHERE `id` = 1